D0kRay/hpe-gauge-small/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_NONE=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_LV_CONF_SKIP=y
CONFIG_FREERTOS_HZ=1000
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_HTTPD_WS_SUPPORT=y
CONFIG_HPE_PIN_LCD_MOSI=10
CONFIG_HPE_PIN_LCD_SCLK=3
CONFIG_HPE_PIN_LCD_CS=2
CONFIG_HPE_PIN_LCD_DC=18
CONFIG_HPE_PIN_LCD_RST=21
CONFIG_HPE_PIN_LCD_BL=42
CONFIG_HPE_PIN_TOUCH_SDA=8
CONFIG_HPE_PIN_TOUCH_SCL=9
CONFIG_HPE_PIN_TOUCH_INT=11
CONFIG_HPE_PIN_TOUCH_RST=0
CONFIG_HPE_PIN_TWAI_TX=43
CONFIG_HPE_PIN_TWAI_RX=44
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_USE_FONT_COMPRESSED=y
CONFIG_LV_DRAW_SW_SUPPORT_RGB565_SWAPPED=y
